// Боловсролын сайдын 2024 оны А/49 тушаалын хавсралт
export const CHIGLEL_MAP = {
  '01. БОЛОВСРОЛ': ['Боловсрол'],
  '02. УРЛАГ, ХҮМҮҮНЛЭГ': ['Урлаг', 'Хэл', 'Урлаг, хүмүүнлэгт хамаарах салбар дундын чиглэл'],
  '03. НИЙГМИЙН ШИНЖЛЭХ УХААН, МЭДЭЭЛЭЛ СЭТГҮҮЛ ЗҮЙ': ['Сэтгүүл зүй, мэдээлэл'],
  '04. БИЗНЕС, УДИРДЛАГА, ЭРХЗҮЙ': ['Бизнес ба удирдахуй'],
  '05. БАЙГАЛИЙН ШИНЖЛЭХ УХААН, МАТЕМАТИК, СТАТИСТИК': ['Хүрээлэн буй орчин', 'Байгалийн шинжлэх ухаан'],
  '06. МЭДЭЭЛЭЛ, ХАРИЛЦАА ХОЛБООНЫ ТЕХНОЛОГИУД': ['Мэдээлэл, харилцаа холбооны технологиуд'],
  '07. ИНЖЕНЕРЧЛЭЛ, ҮЙЛДВЭРЛЭЛ, БАРИЛГА БАЙГУУЛАМЖ': ['Инженерчлэл, инженерийн үйлдвэрлэл', 'Үйлдвэрлэл, боловсруулалт', 'Архитектур ба барилга, угсралт'],
  '08. ХӨДӨӨ АЖ АХУЙ, ОЙ, ЗАГАСНЫ АЖ АХУЙ, МАЛ ЭМНЭЛЗҮЙ': ['Хөдөө аж ахуй', 'Ойн аж ахуй', 'Мал эмнэлэг'],
  '09. ЭРҮҮЛ МЭНД, НИЙГМИЙН ХАМГААЛАЛ': ['Эрүүл мэнд', 'Нийгмийн хамгаалал'],
  '10. ҮЙЛЧИЛГЭЭ': ['Хувь хүний үйлчилгээ', 'Аюулгүй байдлыг хангах', 'Тээврийн үйлчилгээ'],
};

export const ALL_SUBS   = Object.values(CHIGLEL_MAP).flat();
export const MAIN_CATS  = Object.keys(CHIGLEL_MAP);
export const getMainCat = (sub) => {
  for (const [main, subs] of Object.entries(CHIGLEL_MAP)) {
    if (subs.includes(sub)) return main;
  }
  return null;
};
